content/man/man1/flatpak-build-sign.1.org
#+TITLE: Manpages - flatpak-build-sign.1
* NAME
flatpak-build-sign - Sign an application or runtime

* SYNOPSIS
*flatpak build-sign* [OPTION...] LOCATION ID [BRANCH]

* DESCRIPTION
Signs the commit for a specified application or runtime in a local
repository. LOCATION is the location of the repository. ID is the name
of the application, or runtime if --runtime is specified. If BRANCH is
not specified, it is assumed to be "master".

Applications can also be signed during build-export, but it is sometimes
useful to add additional signatures later.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*--gpg-sign=KEYID*

#+begin_quote
Sign the commit with this GPG key. This option can be used multiple
times.

#+end_quote

*--gpg-homedir=PATH*

#+begin_quote
GPG Homedir to use when looking for keyrings

#+end_quote

*--runtime*

#+begin_quote
Sign a runtime instead of an app.

#+end_quote

*--arch=ARCH*

#+begin_quote
The architecture to use. See *flatpak --supported-arches* for
architectures supported by the host.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* EXAMPLES
*$ flatpak build-sign
--gpg-sign=D8BA6573DDD2418027736F1BC33B315E53C1E9D6 /some/repo
org.my.App*

* SEE ALSO
*ostree*(1), *flatpak*(1), *flatpak-build-export*(1),
*flatpak-build*(1),
