public/man/man1/flatpak-build-sign.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-build-sign.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-build-sign.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-build-sign - Sign an application or runtime</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak build-sign</strong> [OPTION…] LOCATION ID [BRANCH]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Signs the commit for a specified application or runtime in a local
repository. LOCATION is the location of the repository. ID is the name
of the application, or runtime if –runtime is specified. If BRANCH is
not specified, it is assumed to be &#34;master&#34;.</p>
<p>
Applications can also be signed during build-export, but it is sometimes
useful to add additional signatures later.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>–gpg-sign=KEYID</strong></p>
<blockquote>
<p>Sign the commit with this GPG key. This option can be used multiple
times.</p>
</blockquote>
<p>
<strong>–gpg-homedir=PATH</strong></p>
<blockquote>
<p>GPG Homedir to use when looking for keyrings</p>
</blockquote>
<p>
<strong>–runtime</strong></p>
<blockquote>
<p>Sign a runtime instead of an app.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>The architecture to use. See <strong>flatpak –supported-arches</strong> for
architectures supported by the host.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>*$ flatpak build-sign
–gpg-sign=D8BA6573DDD2418027736F1BC33B315E53C1E9D6 /some/repo
org.my.App*</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*ostree*(1), *flatpak*(1), *flatpak-build-export*(1),
*flatpak-build*(1),</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
